{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.4", "config": [{"class_name": "Conv1D", "config": {"filters": 64, "activity_regularizer": null, "name": "conv1d_1", "dtype": "float32", "bias_regularizer": null, "padding": "same", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "trainable": true, "kernel_constraint": null, "batch_input_shape": [null, 16, 1], "kernel_regularizer": null, "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "use_bias": true, "kernel_size": [3], "dilation_rate": [1]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "MaxPooling1D", "config": {"pool_size": [2], "name": "max_pooling1d_1", "trainable": true, "padding": "valid", "strides": [2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "name": "dense_1", "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 128, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "name": "dropout_1", "seed": null, "rate": 0.5}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "name": "dense_2", "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "units": 2, "kernel_constraint": null, "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "trainable": true}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "sigmoid"}}]}