{"keras_version": "2.1.5", "class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv1D", "config": {"filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "dilation_rate": [1], "activity_regularizer": null, "batch_input_shape": [null, 15, 1], "name": "conv1d_2", "trainable": true, "kernel_size": [3], "dtype": "float32", "bias_regularizer": null, "kernel_regularizer": null, "padding": "same", "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"strides": [2], "name": "max_pooling1d_2", "trainable": true, "pool_size": [2], "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "use_bias": true, "kernel_constraint": null, "activation": "linear", "units": 128, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "rate": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4", "use_bias": true, "kernel_constraint": null, "activation": "linear", "units": 2, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "name": "activation_6", "trainable": true}}]}