{"class_name": "Sequential", "keras_version": "2.1.5", "config": [{"class_name": "Conv1D", "config": {"bias_regularizer": null, "batch_input_shape": [null, 16, 1], "name": "conv1d_2", "padding": "same", "trainable": true, "activation": "linear", "dtype": "float32", "kernel_size": [3], "filters": 64, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_constraint": null, "strides": [1], "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "strides": [2], "name": "max_pooling1d_2", "padding": "valid", "pool_size": [2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "units": 128, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_2", "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "activation": "linear", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "units": 2, "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_6"}}], "backend": "tensorflow"}