{"config": [{"config": {"use_bias": true, "kernel_size": [3], "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "batch_input_shape": [null, 16, 1], "dtype": "float32", "dilation_rate": [1], "bias_regularizer": null, "activation": "linear", "kernel_constraint": null, "bias_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv1d_1", "padding": "same", "activity_regularizer": null, "filters": 64, "strides": [1]}, "class_name": "Conv1D"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "max_pooling1d_1", "strides": [2], "pool_size": [2], "padding": "valid"}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"use_bias": true, "kernel_constraint": null, "units": 128, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "bias_constraint": null, "trainable": true, "name": "dense_1", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"seed": null, "trainable": true, "name": "dropout_1", "noise_shape": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"use_bias": true, "kernel_constraint": null, "units": 2, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "bias_constraint": null, "trainable": true, "name": "dense_2", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_3", "activation": "sigmoid"}, "class_name": "Activation"}], "keras_version": "2.1.5", "backend": "tensorflow", "class_name": "Sequential"}