{"config": [{"config": {"kernel_size": [3], "dtype": "float32", "use_bias": true, "trainable": true, "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "filters": 64, "batch_input_shape": [null, 122, 1], "bias_regularizer": null, "padding": "same", "activation": "linear", "dilation_rate": [1], "strides": [1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv1d_1"}, "class_name": "Conv1D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"strides": [2], "trainable": true, "padding": "valid", "pool_size": [2], "name": "max_pooling1d_1"}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "units": 128, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"noise_shape": null, "name": "dropout_1", "trainable": true, "rate": 0.5, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "units": 2, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null, "activation": "linear", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "sigmoid", "name": "activation_3"}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.5"}