{"class_name": "Sequential", "config": [{"class_name": "Conv1D", "config": {"kernel_size": [3], "kernel_regularizer": null, "padding": "same", "name": "conv1d_1", "activity_regularizer": null, "use_bias": true, "strides": [1], "batch_input_shape": [null, 124, 1], "trainable": true, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1], "filters": 64, "activation": "linear", "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d_1", "trainable": true, "strides": [2], "padding": "valid", "pool_size": [2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "name": "dense_1", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 128, "bias_constraint": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "seed": null, "rate": 0.5, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "name": "dense_2", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "bias_constraint": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "sigmoid"}}], "backend": "tensorflow", "keras_version": "2.1.5"}