{"keras_version": "2.1.5", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv1D", "config": {"kernel_regularizer": null, "filters": 64, "padding": "same", "use_bias": true, "bias_constraint": null, "strides": [1], "kernel_size": [3], "trainable": true, "dilation_rate": [1], "batch_input_shape": [null, 122, 1], "name": "conv1d_2", "dtype": "float32", "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}}, {"class_name": "MaxPooling1D", "config": {"pool_size": [2], "padding": "valid", "name": "max_pooling1d_2", "trainable": true, "strides": [2]}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "bias_constraint": null, "units": 128, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_3", "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_5", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "name": "dropout_2", "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "bias_constraint": null, "units": 2, "kernel_constraint": null, "activity_regularizer": null, "name": "dense_4", "activation": "linear", "bias_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "name": "activation_6", "trainable": true}}]}