{"config": [{"config": {"name": "conv1d_1", "dilation_rate": [1], "dtype": "float32", "kernel_constraint": null, "activation": "linear", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "same", "kernel_regularizer": null, "strides": [1], "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_size": [3], "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "batch_input_shape": [null, 124, 1], "filters": 64}, "class_name": "Conv1D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "max_pooling1d_1", "trainable": true, "padding": "valid", "pool_size": [2], "strides": [2]}, "class_name": "MaxPooling1D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "trainable": true, "units": 128, "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "trainable": true, "units": 1, "kernel_regularizer": null, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "activation_3", "trainable": true, "activation": "sigmoid"}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.5"}