{"backend": "tensorflow", "config": [{"config": {"bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "same", "use_bias": true, "filters": 64, "name": "conv1d_2", "activation": "linear", "trainable": true, "strides": [1], "bias_constraint": null, "kernel_constraint": null, "kernel_size": [3], "batch_input_shape": [null, 122, 1], "activity_regularizer": null, "dilation_rate": [1], "kernel_regularizer": null}, "class_name": "Conv1D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}, {"config": {"padding": "valid", "trainable": true, "strides": [2], "pool_size": [2], "name": "max_pooling1d_2"}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "name": "flatten_2"}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_3", "activation": "linear", "trainable": true, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "units": 128, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "class_name": "Activation"}, {"config": {"seed": null, "trainable": true, "rate": 0.5, "noise_shape": null, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_4", "activation": "linear", "trainable": true, "bias_constraint": null, "kernel_constraint": null, "activity_regularizer": null, "units": 2, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"activation": "sigmoid", "trainable": true, "name": "activation_6"}, "class_name": "Activation"}], "keras_version": "2.1.5", "class_name": "Sequential"}