{"class_name": "Sequential", "keras_version": "2.1.5", "config": [{"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_size": [3], "name": "conv1d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "batch_input_shape": [null, 124, 1], "dtype": "float32", "bias_regularizer": null, "filters": 64, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "padding": "same", "use_bias": true, "activation": "linear", "dilation_rate": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "MaxPooling1D", "config": {"pool_size": [2], "trainable": true, "padding": "valid", "strides": [2], "name": "max_pooling1d_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "units": 128, "name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "name": "dropout_2", "seed": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "units": 1, "name": "dense_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_6"}}], "backend": "tensorflow"}