{"backend": "tensorflow", "keras_version": "2.1.5", "config": [{"class_name": "Conv1D", "config": {"padding": "same", "dtype": "float32", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "filters": 64, "kernel_size": [3], "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_1", "dilation_rate": [1], "activation": "linear", "kernel_constraint": null, "use_bias": true, "bias_regularizer": null, "batch_input_shape": [null, 124, 1], "strides": [1], "bias_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "trainable": true, "name": "max_pooling1d_1", "pool_size": [2], "strides": [2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "name": "dense_1", "units": 128, "bias_regularizer": null, "use_bias": true, "bias_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "seed": null, "rate": 0.5, "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "kernel_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "name": "dense_2", "units": 1, "bias_regularizer": null, "use_bias": true, "bias_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "sigmoid", "name": "activation_3"}}], "class_name": "Sequential"}